DataProcessors/РеализацияТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>РеализацияТовара</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндексПоследнегоНомера</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтраницы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаТовара</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолеПоискаТовара2</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КэшНоменклатурыПоРодителям</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОстаткиТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТоваров</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/ТипСклада.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ТипСклада</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОПТ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>Продажи</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиТоваров</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СуммаПродажи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладРеализации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТЧ</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТМЦ</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмирения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ЕдиницыИзмирения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентНаценки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>30</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазваниеНаЭтикетке</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФОП</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФискальнаПродажа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НалоговаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НалоговыеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УКТЗЕТ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ШтрихКоды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ШтрихКод</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипШтрихКода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыШтрихКодов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/РеализацияТовара/Forms/Форма/Ext/Form/Module.bsl
//#Область ОписаниеПеременных
//#КонецОбласти

//#Область ОбработчикиСобытийФормы


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеИнтерфейсом(); 
		//НовыйВыводТоваров();
	НомерСтраницыПараметр = 1;   
	ОбработчикУправлениеПанелиТоваров("ПриОткрытии");
	//АктивацияПоляПоиск();
	//АктивироватьПоиск();
	//Если Объект.ТекущаяГруппа.Пустая() Тогда
	//	Элементы.Назад.Доступность = Ложь;
	//Иначе 
	//	Элементы.Назад.Доступность = Истина;
	//КонецЕсли;	
КонецПроцедуры

//#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаСервере
Функция  ПроверкаЗаполненияПолей()
	
	Для Каждого ТМЦ Из Объект.ТЧ Цикл
		Если ТМЦ.Количество = 0 Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнено количество для товара " + ТМЦ.Номенклатура;
			Сообщение.Сообщить();;
			Возврат Ложь;
		ИначеЕсли ТМЦ.Цена = 0 Тогда      
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не заполнено цена для товара " + ТМЦ.Номенклатура;
			Сообщение.Сообщить();;
			Возврат Ложь;
		//ИначеЕсли ТМЦ.Сумма = 0 Тогда      
		//	Сообщение = Новый СообщениеПользователю;
		//	Сообщение.Текст = "Не заполнено сумм для товара " + ТМЦ;
		//	Сообщение.Сообщить();;

		//	Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
КонецФункции


#КонецОбласти

//#Область ОбработчикиСобытийЭлементовТаблицыФормыТЧ


//#КонецОбласти

//#Область ОбработчикиКомандФормы


&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	ЗавершитьРаботуСистемы(Ложь); 
КонецПроцедуры

&НаСервере
Процедура ОчиститьЧек()
	Объект.ТЧ.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура Удалить(Команда)
	Ответ = Вопрос("Удалить весь товар из чека?", РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ОчиститьЧек();
	КонецЕсли;
	 
	ПослеЗавершенияВзаимодействияПользователя();
КонецПроцедуры




//поиск из поля тч штрихкод
&НаКлиенте
Процедура ТЧШтрихКодПриИзменении(Элемент) //пока не использую, требует доработки
	
	//Штрихкод = Число(Элементы.ПолеПоискаТовара.ТекстРедактирования);
	//
	//Если Штрихкод = 0 Тогда
	//	Возврат;
	//КонецЕсли;    
	//
	//ОбработатьПоискТовара(Штрихкод);
	////ПослеЗавершенияПоиска();
	//
КонецПроцедуры







&НаСервере
Процедура ПересчетСуммы(ИдентификаторСтроки)

	ТекущаяСтрока = Объект.ТЧ.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущаяСтрока.Сумма = ТекущаяСтрока.Цена * ТекущаяСтрока.Количество;

КонецПроцедуры // ПересчетСуммы()


&НаКлиенте
Процедура ТЧКоличествоПриИзменении(Элемент)
	ИдентификаторСтроки = Элементы.ТЧ.ТекущаяСтрока;
	ПересчетСуммы(ИдентификаторСтроки);      
	АктивацияПоляПоиск();
КонецПроцедуры


&НаКлиенте
Процедура ТЧЦенаПриИзменении(Элемент)
	ИдентификаторСтроки = Элементы.ТЧ.ТекущаяСтрока;
	ПересчетСуммы(ИдентификаторСтроки);      
	АктивацияПоляПоиск();
КонецПроцедуры





&НаСервере
Процедура ОбновитьНастройкиОтображенияПанелиТоваров(ДействиеПользователя = Неопределено)
	
	//назад           
	Если ДействиеПользователя = "Назад" Тогда
		Если ТекущаяГруппа.Пустая() Тогда
			Возврат;
		КонецЕсли;
		НомерСтраницы = 1;
		ТекущаяГруппа = ТекущаяГруппа.Родитель;
	КонецЕсли;//страница вперед
	
	Если ДействиеПользователя = "ПредыдущаяСтраница" Тогда
		Если ТекущаяГруппа = 1 Тогда
			Возврат;
		КонецЕсли;
		НомерСтраницы = НомерСтраницы - 1;
	КонецЕсли;//страница вперед

	Если ДействиеПользователя = "CледущаяСтраница" Тогда
		//надо поставить ограничитель для перелистывания больше диапозона
		//Если ТекущаяГруппа = 1 Тогда
		//	Возврат;
		//КонецЕсли;
		НомерСтраницы = НомерСтраницы + 1;
	КонецЕсли;//страница вперед

	//НомерСтраницы = НомерСтраницы + 1;
	//страница назад
	//выбор команды товара

	//первичный вход в панель       
	Если ДействиеПользователя = Неопределено Тогда
		НомерСтраницы = 1;
		ТекущаяГруппа = "";    
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция ПолучитьСписокНоменклатурыДляСтраницы(Родитель = Неопределено, НомерСтраницы, КоличествоНаСтраницу)
	
	Родитель = ТекущаяГруппа;
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    Номенклатура.Код КАК Код,
        |    Номенклатура.Наименование КАК Наименование,
        |    Номенклатура.НазваниеНаЭтикетке КАК НазваниеЦенни,
        |    Номенклатура.ЭтоГруппа КАК ЭтоГруппа
        |ИЗ
        |    Справочник.Номенклатура КАК Номенклатура
        |ГДЕ
        |    Номенклатура.Родитель = &Родитель
        |    И Номенклатура.ПометкаУдаления = ЛОЖЬ
        |УПОРЯДОЧИТЬ ПО
        |    ЭтоГруппа УБЫВ,
        |    Наименование";
    
    Запрос.УстановитьПараметр("Родитель", Родитель);
    
    Результат = Запрос.Выполнить().Выбрать();
    
    МассивНоменклатуры = Новый Массив;
    НачалоВывод = (НомерСтраницы - 1) * КоличествоНаСтраницу;
    Счетчик = 0;
    ТекущийЭлементКом = 0;
    
    Пока Результат.Следующий() Цикл
        Счетчик = Счетчик + 1;
        Если Счетчик <= НачалоВывод Тогда Продолжить; КонецЕсли;
		Если ТекущийЭлементКом >= КоличествоНаСтраницу Тогда 
			Прервать;
		КонецЕсли;
        
        СтруктураЭлемента = Новый Структура("Код, Наименование, НазваниеЦенни, ЭтоГруппа",
            Результат.Код, Результат.Наименование, Результат.НазваниеЦенни, Результат.ЭтоГруппа);
        МассивНоменклатуры.Добавить(СтруктураЭлемента);
        
        ТекущийЭлементКом = ТекущийЭлементКом + 1;
    КонецЦикла;
    
    Возврат МассивНоменклатуры; 
	
КонецФункции    

//&НаКлиенте
//Процедура АктивизироватьПоиск(Команда)
//	НовыйВыводТоваров();
//КонецПроцедуры

&НаСервере
Функция ПолучитьПараметрыПанели()     //устарело
    // Здесь можно взять значения из настройки, формы или констант; пока дефолты
    КоличествоВРяду = 4;  // Кнопок в ряду
    КоличествоРядов = 6;  // Рядов на странице

    // Валидация
	КоличествоВРяду = ?(КоличествоВРяду <= 0, КоличествоВРяду = 4, КоличествоВРяду);
	КоличествоРядов = ?(КоличествоРядов <= 0, КоличествоРядов = 6, КоличествоРядов);
    
    Возврат Новый Структура("КоличествоВРяду, КоличествоРядов", КоличествоВРяду, КоличествоРядов);  
	
КонецФункции    


#Область ВзаимодействиеСоСканером

&НаКлиенте
Процедура АктивацияПоляПоиск();

    ОбновитьНастройкиОтображенияПанелиТоваров();
	ТекущийЭлемент = Элементы.ПолеПоискаТовара;

КонецПроцедуры

&НаСервере
Процедура ОчиститьПоляПоиска()

	Объект.ПолеПоискаТовара = 0;
	Объект.ПолеПоискаТовара2 = 0;

КонецПроцедуры // ОчиститьПоляПоиска()

&НаКлиенте
Процедура ПослеЗавершенияВзаимодействияПользователя(ТекущийАктинвыйЭлементПоиска = "")
	
	Если ТекущийАктинвыйЭлементПоиска = "ПолеПоискаТовара" Тогда
		АктивироватьПоле = Элементы.ПолеПоискаТовара2;   
	Иначе                                   
		АктивироватьПоле = Элементы.ПолеПоискаТовара;
	КонецЕсли;
	
	ТекущийЭлемент = АктивироватьПоле;
	
	ОчиститьПоляПоиска();
	
КонецПроцедуры     


#КонецОбласти       

#Область ОбработчикиДобавленияТоваров

&НаСервере
Процедура ОбработчикДобавленияПоШтрихкоду(Штрихкод)
    //ОПИСАНИЕ ОБРАБОТКИ ДОБАВЛЕНИЯ НОМЕНКЛАТУРЫ
	//1. Валидация штрихкода.
	//2. Поиск номенклатуры по штрихкоду.
	//3. Дальнейшее добавление товара идет по одному принципу. Товар добавляется в строку по идентификатору.
	//В зависимости от наличие товара в чеке, будет создана новая строка, если товара не было, либо добавленов строку, где товар уже есть.
	//проверки
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Штрихкод, "Число") Тогда
		Возврат;
	КонецЕсли;  
	
	//поиск
	НайденаяНоменклатура = ПоискНомеклатурыПоШтрихкоду(Штрихкод);  
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(НайденаяНоменклатура, "СправочникСсылка.Номенклатура") Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Товар со штрихкодом " + Штрихкод + " не найден!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;

	//проверка на уже использования    
	РезультатПоиска = НаличиеТовараВЧеке(НайденаяНоменклатура);

	Если РезультатПоиска = Неопределено Тогда //создаем новую строку
		ИдентификаторСтроки = ДобавитьПустуюСтроку();
	Иначе
		ИдентификаторСтроки = РезультатПоиска;
	КонецЕсли;                
	
	//обработка найденого товара
	НоменклатураВыбрана(НайденаяНоменклатура, ИдентификаторСтроки);

КонецПроцедуры // ОбработчикДобавленияПоШтрихкоду()


&НаСервере
Функция ДобавитьПустуюСтроку()

	НоваяСтрока = Объект.ТЧ.Добавить();
		
	Возврат НоваяСтрока.ПолучитьИдентификатор();

КонецФункции 

&НаСервере
Процедура НоменклатураВыбрана(Номенклатура, ИдентификаторСтроки)
	
    Товар = Объект.ТЧ.НайтиПоИдентификатору(ИдентификаторСтроки);
	Если НЕ ЗначениеЗаполнено(Товар.Номенклатура) Тогда
		Товар.Номенклатура = Номенклатура;
	КонецЕсли;    
	
	Если НЕ ЗначениеЗаполнено(Товар.Цена) Тогда
		Товар.Цена = Справочники.Номенклатура.ПолучитьЦенуТовара(Номенклатура);
	КонецЕсли;
	
	Товар.Количество = Товар.Количество + 1;
	
	Товар.Сумма = Товар.Цена * Товар.Количество;
	
	Если НЕ ЗначениеЗаполнено(Товар.Цена) Тогда
		Товар.Цена = Справочники.Номенклатура.ПолучитьЦенуТовара(Номенклатура);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Товар.ОстатокНаСкладе) Тогда
		ОстатокТовара = РегистрыНакопления.ОстаткиТоваров.ОстатокТовара(Номенклатура, ПодготовкаДанных.ОсновнойСклад(Перечисления.ТипСклада.ОПТ)); 
        Если Не ЗначениеЗаполнено(ОстатокТовара) Тогда
			Товар.ОстатокНаСкладе = 0;
		Иначе
			Товар.ОстатокНаСкладе = ОстатокТовара;
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Товар.ШтрихКод) Тогда
		Товар.ШтрихКод = Справочники.Номенклатура.ШтрихкодНоменклатуры(Номенклатура);
	КонецЕсли;
	
КонецПроцедуры 

&НаСервере
Функция НаличиеТовараВЧеке(Номенклатура)
    
    Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Номенклатура, "СправочникСсылка.Номенклатура") Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    ПараметрыПоиска = Новый Структура;
    ПараметрыПоиска.Вставить("Номенклатура", Номенклатура);
    
    РезультатПоиска = Объект.ТЧ.НайтиСтроки(ПараметрыПоиска);

    Если РезультатПоиска.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
	Идентификатор = РезультатПоиска[0].ПолучитьИдентификатор();	  
	
    Возврат Идентификатор;

КонецФункции

&НаСервере
Функция ПоискНомеклатурыПоШтрихкоду(Штрихкод)

	Возврат Справочники.Номенклатура.ГлобальныйПоискПоШтрихКоду(Штрихкод);	

КонецФункции 

#КонецОбласти       

#Область ОбработчикиПанелиТоваров  //подготовка данных для отображения команд



&НаКлиенте
Процедура КомандаДобавитьТовар(Команда)  
	Код = Число(СтрЗаменить(СтрЗаменить(Команда.Имя,"Код",""),"Группа",""));
	ЭтоГруппа = ?(СтрНайти(Команда.Имя,"Группа")=0, Ложь, Истина);
	
	
	Если ЭтоГруппа Тогда
		ТекущаяГруппа = ПоискНомеклатурыПоШтрихкоду(Код);
		ОбработчикУправлениеПанелиТоваров("Группа");
		//ОбновитьДанныеПанелиТоваров(Группа);
	Иначе
		ОбработчикДобавленияПоШтрихкоду(Код);
	КонецЕсли;
	
	ПослеЗавершенияВзаимодействияПользователя(); 
КонецПроцедуры

#КонецОбласти         

#Область УправлениеИнтерфейсаПанелиТоваров    //все что касается отображения команд
Процедура ОбработчикУправлениеПанелиТоваров(Действие)   //отвечает за изминения состояние панели 
	
	МассивТоваров = Неопределено;
	
	Если Действие = "CледущаяСтраница" Тогда
		//надо проверка возможности листать      
		НомерСтраницыПараметр = НомерСтраницыПараметр + 1;	

		МассивТоваров = МассивНоменклатурыПоПараметрам();
		Если МассивТоваров.Количество() = 0 Тогда 
			НомерСтраницыПараметр = НомерСтраницыПараметр - 1;	
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Действие = "ПредыдущаяСтраница" Тогда
		Если НомерСтраницыПараметр = 1 Тогда
			Возврат;
		Иначе 
			НомерСтраницыПараметр = НомерСтраницыПараметр - 1;
		КонецЕсли;
	КонецЕсли;

	Если Действие = "Назад" Тогда
		
		Если НЕ ЗначениеЗаполнено(ТекущаяГруппа) И НомерСтраницыПараметр = 1 Тогда
			Возврат;
		КонецЕсли;
		НомерСтраницыПараметр = 1;
		Если ЗначениеЗаполнено(ТекущаяГруппа) Тогда
			ТекущаяГруппа = ТекущаяГруппа.Родитель;
		КонецЕсли   
		
	КонецЕсли;
	
	Если Действие = "Группа" Тогда
		НомерСтраницыПараметр = 1;
	КонецЕсли;	  
	
	Если НЕ ЗначениеЗаполнено(МассивТоваров) Тогда 
		МассивТоваров = МассивНоменклатурыПоПараметрам();
	КонецЕсли;
	ОбновитьОтображениеНоменклатуры(МассивТоваров); 
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеИнтерфейсом()

	РежимОтображенияПанели();	
    ИнициализацияНастроекПанели();  
	СоздатьГруппыРядов();
	
КонецПроцедуры 


&НаКлиенте
Процедура РежимОтображенияПанели()
	
	Элементы.ГруппаВыборТовара.Видимость = ПоказатьПанельТоваров; 
	ПослеЗавершенияВзаимодействияПользователя();    
	
КонецПроцедуры


&НаСервере
Процедура ИнициализацияНастроекПанели()

	КоличествоВРяду = 4;
	КоличествоРядов = 6;
	
	//создание групп
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	УдалитьГруппыРядов();
КонецПроцедуры

// Процедура для создания групп рядов
&НаСервере
Процедура СоздатьГруппыРядов()
    Для ИндексРяда = 0 По КоличествоРядов - 1 Цикл
        ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
        ГруппаРяда = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Элементы.ГруппаВыборТовара);
		ГруппаРяда.Вид = ВидГруппыФормы.ОбычнаяГруппа;
        ГруппаРяда.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
        ГруппаРяда.Ширина = 70;
        ГруппаРяда.Высота = 3;
    КонецЦикла;
КонецПроцедуры  

&НаСервере
Процедура УдалитьЭлементыГрупп()
	МассивГруппРядов = Новый Массив;
	Для ИндексРяда = 0 По КоличествоРядов - 1 Цикл
	    ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
	    ГруппаРяда = Элементы.Найти(ИмяГруппы);
	    Если ГруппаРяда <> Неопределено Тогда
	        МассивГруппРядов.Добавить(ГруппаРяда);
	    КонецЕсли;
	КонецЦикла;

	Если МассивГруппРядов.Количество() = 0 Тогда
	    Сообщить("Группы рядов не найдены.");
	    Возврат;
	КонецЕсли;

	Для Каждого Группа Из МассивГруппРядов Цикл
	    ПодчинЭлементы = Группа.ПодчиненныеЭлементы;
		Если ПодчинЭлементы.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Индекс = ПодчинЭлементы.Количество() - 1;
		Пока Индекс >=0 Цикл
			Элемент = ПодчинЭлементы[Индекс];
	        Если ТипЗнч(Элемент) = Тип("КнопкаФормы") Тогда
	            Команды.Удалить(Команды[Элемент.ИмяКоманды]);
	            Элементы.Удалить(Элемент);
			КонецЕсли;  
			Индекс = Индекс - 1;
		КонецЦикла;   
		
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура УдалитьГруппыРядов()
	УдалитьЭлементыГрупп(); // Сначала очищаем кнопки
    
	МассивИменГрупп = Новый Массив;
    Для Каждого ЭлементФормы Из Элементы Цикл
        Если СтрНачинаетсяС(ЭлементФормы.Имя, "ГруппаРяд") И НЕ СтрЗаканчиваетсяНа(ЭлементФормы.Имя, "РасширеннаяПодсказка")  Тогда
            МассивИменГрупп.Добавить(ЭлементФормы.Имя);
        КонецЕсли;
    КонецЦикла;
    
    Для Каждого ИмяГруппы Из МассивИменГрупп Цикл
		Элементы.Удалить(Элементы[ИмяГруппы]);
	КонецЦикла;   
	
КонецПроцедуры


&НаСервере
Процедура ОбновитьОтображениеНоменклатуры(МассивНоменклатурыДляВывода)
	КоличествоНаСтраницу = КоличествоВРяду * КоличествоРядов;

	Если МассивНоменклатурыДляВывода.Количество() = 0 Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет данных для отображения.";
		Сообщение.Сообщить();
	    Возврат;
	КонецЕсли;

	УдалитьЭлементыГрупп(); // Очистка старых кнопок без удаления групп

	МассивГруппРядов = Новый Массив;
	Для ИндексРяда = 0 По КоличествоРядов - 1 Цикл
	    ИмяГруппы = "ГруппаРяд" + Строка(ИндексРяда + 1);
	    ГруппаРяда = Элементы.Найти(ИмяГруппы);
	    Если ГруппаРяда <> Неопределено Тогда
	        МассивГруппРядов.Добавить(ГруппаРяда);
	    КонецЕсли;
	КонецЦикла;

	Если МассивГруппРядов.Количество() = 0 Тогда
	    Сообщить("Группы рядов не найдены.");
	    Возврат;
	КонецЕсли;

	// Создание команд и кнопок
	СчетчикЭлементов = 0;
	Для Каждого Элемент Из МассивНоменклатурыДляВывода Цикл
	    СчетчикЭлементов = СчетчикЭлементов + 1;
	    Если СчетчикЭлементов > КоличествоНаСтраницу Тогда
	        Объект.ИндексПоследнегоНомера = СчетчикЭлементов;
	        Прервать;
	    КонецЕсли;
	    
	    ИмяКоманды = "Код" + Формат(Элемент.Код, "ЧРГ=; ЧГ=0");
	    Если Элемент.ЭтоГруппа Тогда ИмяКоманды = ИмяКоманды + "Группа"; КонецЕсли;
	    
	    ЗаголовокКоманды = ?(ПустаяСтрока(Элемент.НазваниеНаЭтикетке), Элемент.Наименование, Элемент.НазваниеНаЭтикетке);
	    НовыйЗаголовок = Лев(ЗаголовокКоманды, 13) + Символы.ПС + Сред(ЗаголовокКоманды, 14);
	    
	    Команда = Команды.Добавить(ИмяКоманды);
	    Команда.Заголовок = НовыйЗаголовок;
	    Команда.Действие = "КомандаДобавитьТовар";
	    
	    ИндексРяда = Цел((СчетчикЭлементов - 1) / КоличествоВРяду);
	    Если ИндексРяда < МассивГруппРядов.Количество() Тогда
	        ГруппаДляОтображения = МассивГруппРядов[ИндексРяда];
	        
	        КнопкаФормы = Элементы.Добавить("Кнопка" + ИмяКоманды, Тип("КнопкаФормы"), ГруппаДляОтображения);
	        КнопкаФормы.ИмяКоманды = ИмяКоманды;
	        КнопкаФормы.Высота = 3;
	        КнопкаФормы.Ширина = 18;
	        КнопкаФормы.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
	        Если Элемент.ЭтоГруппа Тогда
	            КнопкаФормы.ЦветФона = Метаданные.ЭлементыСтиля.ЦветКнопкиГруппы.Значение;
	            Объект.НомерСтраницы = 1;
	        КонецЕсли;
	    КонецЕсли;
	КонецЦикла;

	Элементы.ГруппаВыборТовара.Ширина = 70;         
	
КонецПроцедуры     

&НаСервере
Функция МассивНоменклатурыПоПараметрам()

	Диапозон = ДиапозонЭлементов();  
	
	Если НЕ ПроверкиДанных.ВалидацияВходныхДанных(Диапозон, "Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//получаем все содержимое группы.     	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Номенклатура.Ссылка КАК Ссылка,
		|	Номенклатура.ЭтоГруппа КАК ЭтоГруппа,
		|	Номенклатура.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоГруппа УБЫВ,
		|	Наименование";
	
	Запрос.УстановитьПараметр("Родитель", ТекущаяГруппа);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	МассивЭлементов = Новый Массив;
	ПорядковыйНомерЭлемента = 0;
	Пока Выборка.Следующий() Цикл
		ПорядковыйНомерЭлемента = ПорядковыйНомерЭлемента + 1;
		Если ПорядковыйНомерЭлемента >= Диапозон.НижняяГраница И ПорядковыйНомерЭлемента <= Диапозон.ВерхняяГраница Тогда // Замените на вашу логику диапазона
			МассивЭлементов.Добавить(Выборка.Ссылка);
	    КонецЕсли;
	КонецЦикла;	
	
	Возврат МассивЭлементов;
	
КонецФункции

&НаСервере
Функция ДиапозонЭлементов()

	ОбщееКоличествоНаСтранице = КоличествоВРяду * КоличествоРядов;

	НижняяГраницаДиапозона = (НомерСтраницыПараметр - 1) * ОбщееКоличествоНаСтранице + 1;
	ВерхняяГраницаДиапозона = НомерСтраницыПараметр * ОбщееКоличествоНаСтранице;

	СтруктураДиапазона = Новый Структура("НижняяГраница, ВерхняяГраница", НижняяГраницаДиапозона, ВерхняяГраницаДиапозона);     
	
	Возврат СтруктураДиапазона;
	
КонецФункции // ДиапозонЭлементов()

&НаКлиенте
Процедура CледущаяСтраница(Команда)
    ОбработчикУправлениеПанелиТоваров(Команда.Имя);	    
	ПослеЗавершенияВзаимодействияПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ПредыдущаяСтраница(Команда)
	ОбработчикУправлениеПанелиТоваров(Команда.Имя);  
	ПослеЗавершенияВзаимодействияПользователя();
КонецПроцедуры      

&НаКлиенте
Процедура Назад(Команда)
	ОбработчикУправлениеПанелиТоваров(Команда.Имя);     
	ПослеЗавершенияВзаимодействияПользователя();
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаТовараПриИзменении(Элемент)
	ОбработкаПоискаПоПолюШтрихкода(Элемент.Имя);
	ПослеЗавершенияВзаимодействияПользователя(Элемент.Имя);	
КонецПроцедуры

&НаКлиенте
Процедура ПолеПоискаТовара2ПриИзменении(Элемент)
	ОбработкаПоискаПоПолюШтрихкода(Элемент.Имя);
	ПослеЗавершенияВзаимодействияПользователя(Элемент.Имя);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПоискаПоПолюШтрихкода(ТекущийАктинвыйЭлементПоиска)

	Если ТекущийАктинвыйЭлементПоиска = "ПолеПоискаТовара" Тогда
		ШтрихкодНоменклатуры = Объект.ПолеПоискаТовара;
	Иначе                                   
		ШтрихкодНоменклатуры = Объект.ПолеПоискаТовара2;
	КонецЕсли;
	
	Если ШтрихкодНоменклатуры = 0 Тогда
		Возврат;
	КонецЕсли;
	
    ОбработчикДобавленияПоШтрихкоду(ШтрихкодНоменклатуры); 
	
КонецПроцедуры // ОбработкаПоискаПоПолюШтрихкода()

#КонецОбласти            


#Область ОбработкаПродажи

&НаКлиенте
Процедура Рассчитать(Команда)
	
	Если Объект.ТЧ.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ПродолжитьПродажу = Вопрос("Подтвердите закрытие чека!", РежимДиалогаВопрос.ДаНет);
	Если НЕ ПродолжитьПродажу = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;  
	
	Если НЕ ПроверкаЗаполненияПолей() Тогда
		Возврат;
	КонецЕсли;
	
	
	РассчитатьНаСервере();
	//ФормированиеТЗПродажи();  
	Предупреждение("Продажа успешно завершена!",5); 
    ПослеЗавершенияВзаимодействияПользователя();         
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьНаСервере()
	
	Продажа = Документы.Продажи.СоздатьДокумент();
	Продажа.Дата = ТекущаяДата();
	Продажа.СкладРеализации = ПодготовкаДанных.ОсновнойСклад(Перечисления.ТипСклада.ОПТ);
	Продажа.СуммаПродажи = Объект.ТЧ.Итог("Сумма");
	Для Каждого Товар Из Объект.ТЧ Цикл
		Если НЕ Товар.Номенклатура.Пустая() Тогда
			Если Товар.Количество > 0 Тогда
				ТМЦ = Продажа.ТЧ.Добавить();
				ТМЦ.ТМЦ = Товар.Номенклатура;
				ТМЦ.Количество = Товар.Количество;
				ТМЦ.Цена = Товар.Цена;
				ТМЦ.Сумма = Товар.Сумма;
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
	Продажа.Записать(РежимЗаписиДокумента.Проведение,РежимПроведенияДокумента.Оперативный);
	
	Объект.ТЧ.Очистить();
	
КонецПроцедуры

&НаКлиенте
Процедура Поиск(Команда)

	ПоказатьВводЧисла(Новый ОписаниеОповещения("ОбработкаВводаЧисла", ЭтотОбъект), 0, "Введите код товара:", 30, 0);

КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаВводаЧисла(Значение, ДополнительныеПараметры) Экспорт
    Если Значение <> Неопределено Тогда
        ОбработчикДобавленияПоШтрихкоду(Значение); 
		ПослеЗавершенияВзаимодействияПользователя();
    КонецЕсли;
КонецПроцедуры


//&НаСервере
//Процедура ФормированиеТЗПродажи()

//	ТЗ_СодержимогоЧека = Новый ТаблицаЗначений;
//	ТЗ_СодержимогоЧека.Колонки.Добавить("Номенклатура");      
//	ТЗ_СодержимогоЧека.Колонки.Добавить("ФОП");
//	ТЗ_СодержимогоЧека.Колонки.Добавить("УКТЗЕД");
//	ТЗ_СодержимогоЧека.Колонки.Добавить("НалоговаяГруппа");
//	ТЗ_СодержимогоЧека.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число"));
//	ТЗ_СодержимогоЧека.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
//	ТЗ_СодержимогоЧека.Колонки.Добавить("Сумма", Новый ОписаниеТипов("Число"));

//	Для Каждого Данные Из Объект.ТЧ Цикл
//		НоваяСтрока = ТЗ_СодержимогоЧека.Добавить();
//		НоваяСтрока.Номенклатура    = Данные.Номенклатура;
//		НоваяСтрока.УКТЗЕД          = Данные.Номенклатура.УКТЗЕТ;
//		НоваяСтрока.ФОП             = Данные.Номенклатура.ФОП;
//		НоваяСтрока.НалоговаяГруппа = Данные.Номенклатура.НалоговаяГруппа;
//		НоваяСтрока.Количество      = Данные.Количество;
//		НоваяСтрока.Цена            = Данные.Цена;
//		НоваяСтрока.Сумма           = Данные.Сумма;
//	КонецЦикла;         
//	
//	ЧекиПоФОПам = Документы.ФискальнаяПродажа.ПодготовкаТЗПоФОПам(ТЗ_СодержимогоЧека);
//	
//	Для Каждого Элемент Из ЧекиПоФОПам Цикл
//		ФОП = Элемент.Ключ;
//		ТЗ = Элемент.Значение;     
//		
//		Документы.ФискальнаяПродажа.СоздатьДокуменФискальнойПродажи(ТЗ, ФОП, Перечисления.ТипРассчетов.БезнальныйРассчет);	
//	КонецЦикла;

//КонецПроцедуры 

//#КонецОбласти


#КонецОбласти       
#Область Тестовые

#КонецОбласти
